#   Licensed to the Apache Software Foundation (ASF) under one or more
#   contributor license agreements.  See the NOTICE file distributed with
#   this work for additional information regarding copyright ownership.
#   The ASF licenses this file to You under the Apache License, Version 2.0
#   (the "License"); you may not use this file except in compliance with
#   the License.  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#   Unless required by applicable law or agreed to in writing, software
#   distributed under the License is distributed on an "AS IS" BASIS,
#   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#   See the License for the specific language governing permissions and
#   limitations under the License.

#Stored by I18NEdit, may be edited!
autoConnectRetry.displayName=Essayer de garder la connexion 
autoConnectRetry.shortDescription=Si positionn\u00E9 \u00E0 True, le gestionnaire continuera d'essayer de se reconnecter au m\u00EAme serveur dans le cas o\u00F9 la connexion socket ne peut \u00EAtre \u00E9tablie. <br> Le d\u00E9lai d'attente maximum pour ressayer est de 15 sec par d\u00E9faut.<br> <br>Cela peut \u00EAtre utile pour \u00E9viter certaines exceptions lev\u00E9es quand un serveur est arr\u00EAt\u00E9 temporairement, bloquant ainsi les op\u00E9rations.<br>Il peut \u00E9galement \u00EAtre utile pour adoucir la transition vers un nouveau ma\u00EEtre (de sorte qu'un nouveau ma\u00EEtre est \u00E9lu au sein le nombre de tentatives de temps) <br><br>N.B. Lorsque vous utilisez cette option \:<br>- pour un jeu de r\u00E9plica, le gestionnaire tente de se connecter \u00E0 l'ancien ma\u00EEtre de ce moment-l\u00E0, au lieu de basculer vers le nouveau -<br>cela n'emp\u00EAche pas l'exception d'\u00EAtre lev\u00E9e en lecture / \u00E9criture sur la socket, qui doit \u00EAtre trait\u00E9e par l'application <br>M\u00EAme si cet indicateur est False, le gestionnaire dispose d\u00E9j\u00E0 de m\u00E9canismes pour recr\u00E9er automatiquement connexions interrompues et de r\u00E9essayer les op\u00E9rations de lecture.<br><br> La valeur par d\u00E9faut est False.
connectTimeout.displayName=Delai d'expiration de connexion 
connectTimeout.shortDescription=Le d\u00E9lai d'expiration de connexion, en millisecondes.<br> Il est utilis\u00E9 uniquement lors de l'\u00E9tablissement d'une nouvelle connexion Socket.connect(java.net.SocketAddress, int)<br><br>La valeur par d\u00E9faut est 0 et signifie aucun d\u00E9lai d'attente.
connection.displayName=Liste adresse serveur 
connection.shortDescription=Liste adresse serveur
connectionsPerHost.displayName=Maximum de connexions par h\u00F4te 
connectionsPerHost.shortDescription=Le nombre maximum de connexions autoris\u00E9es par h\u00F4te for cette instance de Mongo.<br><br>Ces connexions seront gard\u00E9es dans un pool quand elles seront disponibles.<br><br>Une fois que le pool est atteint, toute op\u00E9ration qui n\u00E9cessite une connexion sera bloqu\u00E9e en attendant une connexion disponible.<br><br>La valeur par d\u00E9faut est 10.
continueOnInsertError.displayName=Continuer en cas d'erreur
continueOnInsertError.shortDescription=Indique si les insertions en batch doivent se poursuivre apr\u00E8s la premi\u00E8re erreur
displayName=Gestionnaire de connexion MongoDB (DEPRECATED)
fsync.displayName=Fsync 
fsync.shortDescription=Valeur Fsync pour l'\u00E9l\u00E9ment global WriteConcern.<br><br>La valeur par d\u00E9faut est False.
maxAutoConnectRetryTime.displayName=Temps de re-tentative maximum 
maxAutoConnectRetryTime.shortDescription=Le d\u00E9lai maximal de temps en milli-secondes pour tenter d'ouvrir une connexion au m\u00EAme serveur.<br><br>La valeur par d\u00E9faut est 0, ce qui signifie que pour utiliser les 15 sec. par d\u00E9faut si autoConnectRetry est activ\u00E9.
maxWaitTime.displayName=Temps d'attente maximum 
maxWaitTime.shortDescription=Le temps d'attente maximum in milli-secondes qu'une unit\u00E9 d'ex\u00E9cution peut attendre pour qu'une connexion devienne disponible.<br><br>La valeur par d\u00E9faut est 120000.
mongodb.displayName=Connexion MongoDB
mongodb.shortDescription=Configurer la connexion
options.displayName=Options MongoDB
options.shortDescription=Divers param\u00E8tres pour le gestionnaire
safe.displayName=S\u00FBret\u00E9 (Safe) 
safe.shortDescription=Si positionn\u00E9 \u00E0 True, le gestionnaire utilisera un WriteConcern de WriteConcern.SAFE pour toutes les op\u00E9rations.<br><br>Si w, wtimeout, fsync or j sont sp\u00E9cifi\u00E9s, ce param\u00E8tre est ignor\u00E9.<br><br>La valeur par d\u00E9faut est False.
socketKeepAlive.displayName=Socket persistante 
socketKeepAlive.shortDescription=Cet indicateur contr\u00F4le la fonctionnalit\u00E9 de garder la socket persistante \u00E0 travers un pare-feu Socket.setKeepAlive(boolean)<br><br>La valeur par d\u00E9faut est false.
socketTimeout.displayName=D\u00E9lai d'expiration Socket 
socketTimeout.shortDescription=Le d\u00E9lai d'expiration de Socket en milli-secondes. Il est utilis\u00E9 pour en E/S de socket pour les op\u00E9rations de lecture et \u00E9criture Socket.setSoTimeout(int)<br><br>La valeur par d\u00E9faut est 0 et signifie \: pas de d\u00E9lai.
source.displayName=Source MongoDB 
source.shortDescription=Configurer la source
threadsAllowedToBlockForConnectionMultiplier.displayName=Multiplicateur de blocage 
threadsAllowedToBlockForConnectionMultiplier.shortDescription=Ce multiplicateur, multipli\u00E9 avec le param\u00E8tre connectionsPerHost, donne le nombre maximal d'unit\u00E9s qui peuvent \u00EAtre en attente qu'une connexion se lib\u00E8re du pool.<br>Au d\u00E9l\u00E0 une exception sera lev\u00E9e imm\u00E9diatement.<br><br>Par exemple, si connectionsPerHost est de 10 et threadsAllowedToBlockForConnectionMultiplier est de 5, Alors jusqu'\u00E0 50 threads peuvent attendre une connexion.<br>La valeur par d\u00E9faut est 5.
waitForJournaling.displayName=Attente du Journal 
waitForJournaling.shortDescription=La valeur j pour l'\u00E9l\u00E9ment global WriteConcern.<br><br>La valeur par d\u00E9faut est False.
writeConcern.displayName=Options Write Concern
writeConcern.shortDescription=Divers param\u00E8tres pour le gestionnaire
writeOperationNumberOfServers.displayName=Attente des serveurs 
writeOperationNumberOfServers.shortDescription=La valeur w pour l'\u00E9l\u00E9ment global WriteConcern.<br><br>La valeur par d\u00E9faut est 0.
writeOperationTimeout.displayName=D\u00E9lai d'attente 
writeOperationTimeout.shortDescription=La valeur wtimeout pour l'\u00E9l\u00E9ment global WriteConcern.<br><br>La valeur par d\u00E9faut est 0.
